src/ChartsOfCalculationTypes/НачисленияИУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>НачисленияИУдержания</Name>
			<Comment>Начисления и удержания</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Comment>Переключатель типа и местонахождения объекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКОбъекту</Name>
					<Comment>Имя объекта метаданных или путь к файлу объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеИлиУдержание</Name>
					<Comment>Признак начисления или удержания</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НачислениеИлиУдержание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресФайлаВоВременномХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

src/Enums/СпособыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыРасчета</Name>
			<Comment>Способы расчета</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДням</Name>
					<Comment>По дням</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суммой</Name>
					<Comment>Суммой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентом</Name>
					<Comment>Процентом</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ChartsOfCalculationTypes/НачисленияИУдержания/Ext/ManagerModule.bsl
// Модуль менеджера плана видов расчета "Начисления и удержания"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Заполняет предопределенные элементы справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	ИмяМакета = "НастройкиПоУмолчанию";
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Не обнаружен макет начальных настроек.'"));
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		// Считаем из макета Имя, Наименование, Код, Периодичность, ВидОбъектаПланирования,
		// ВидАналитикиПланирования1, ВидАналитикиПланирования2, ПоказательПлана1, ПоказательПлана2,
		// ПоказательПлана3, Параметры.
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрСтатьяДоходовИРасходов = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрСпособРасчета =	СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрНачислениеИлиУдержание =	СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		
		// Получим элемент вида плана
		СсылкаНачислениеУдержание = ПланыВидовРасчета.НачисленияИУдержания[СтрИмя];
		Если СсылкаНачислениеУдержание.Пустая() Тогда
			ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении вида плана:'") + " " + СтрНаименование 
				+ ". " + НСтр("ru = 'Указан отсутствующий элемент справочника виды планов.'"));
			Продолжить;
		Иначе
			ОбъектНачислениеУдержание = СсылкаНачислениеУдержание.ПолучитьОбъект();
		КонецЕсли;
		
		// Заполняем реквизиты
		Если НЕ ЗначениеЗаполнено(ОбъектНачислениеУдержание.Наименование) Тогда
			ОбъектНачислениеУдержание.Наименование = СтрНаименование;
		КонецЕсли;
		
		// Получим периодичность планирования
		Если ЗначениеЗаполнено(СтрСтатьяДоходовИРасходов) Тогда
			СсылкаСтрСтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов[СтрСтатьяДоходовИРасходов];
			Если СсылкаСтрСтатьяДоходовИРасходов.Пустая() Тогда
				ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении статьи доходов и расходов элемента:'") + " " + СтрНаименование 
				+ " " + НСтр("ru = 'Значение статья:'") + " "+СтрСтатьяДоходовИРасходов+" " + НСтр("ru = 'не найдено'"));
			Иначе
				Если НЕ ЗначениеЗаполнено(ОбъектНачислениеУдержание.СтатьяДоходовИРасходов) Тогда
					ОбъектНачислениеУдержание.СтатьяДоходовИРасходов = СсылкаСтрСтатьяДоходовИРасходов;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении статьи доходов и расходов элемента:'") +" " + СтрНаименование 
				+ " " + НСтр("ru = 'Значение статья:'") + " "+СтрСтатьяДоходовИРасходов+" " + НСтр("ru = 'не найдено'"));
		КонецЕсли;
		
		// Получим Вид объекта планирования
		Если ЗначениеЗаполнено(СтрСпособРасчета) Тогда
			СсылкаСпособРасчета = Перечисления.СпособыРасчета[СтрСпособРасчета];
			Если СсылкаСпособРасчета.Пустая() Тогда
				ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении способа расчета элемента:'") +  " " + СтрНаименование 
					+ " " + НСтр("ru = 'Способ расчета:'") + " "+СтрСпособРасчета+" " + НСтр("ru = 'не найден'"));
			Иначе
				Если НЕ ЗначениеЗаполнено(ОбъектНачислениеУдержание.СпособРасчета) Тогда
					ОбъектНачислениеУдержание.СпособРасчета = СсылкаСпособРасчета;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении статьи расчета элемента:'") + " " + СтрНаименование 
				+ " " +НСтр("ru = 'Значение статья:'") + " " + СтрСпособРасчета + " " + НСтр("ru = 'не найдено'"));
		КонецЕсли;
		
		// Получим признак начисления/удержания
		Если ЗначениеЗаполнено(СтрНачислениеИлиУдержание) Тогда
			СсылкаНачислениеИлиУдержание = Перечисления.НачислениеИлиУдержание[СтрНачислениеИлиУдержание];
			Если СсылкаНачислениеИлиУдержание.Пустая() Тогда
				ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении признака начисления/удержания элемента:'") + " " + СтрНаименование 
					+ " " + НСтр("ru = 'Признак начисления/удержания:'") + " "+СтрНачислениеИлиУдержание+" " + НСтр("ru = 'не найден'"));
			Иначе
				Если НЕ ЗначениеЗаполнено(ОбъектНачислениеУдержание.НачислениеИлиУдержание) Тогда
					ОбъектНачислениеУдержание.НачислениеИлиУдержание = СсылкаНачислениеИлиУдержание;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВывестиСообщение(НСтр("ru = 'Ошибка при заполнении признака начисления/удержания элемента:'") + " " + СтрНаименование 
				+ " " + НСтр("ru = 'Значение признака:'") + " "+СтрНачислениеИлиУдержание+" " + НСтр("ru = 'не найдено'"));
		КонецЕсли;
		
		// Сохранение справочника
		НовыйЭлемент = ОбъектНачислениеУдержание.ЭтоНовый();
		Если ОбъектНачислениеУдержание.Модифицированность() Тогда
			Попытка
				ОбъектНачислениеУдержание.Записать();
				ВывестиСообщение(НСтр("ru = 'План видов расчета ""Начисления и удержания'") + """. "
					+?(НовыйЭлемент,"Создан","Модифицирован")+" " + "элемент" + " """
					+ СокрЛП(ОбъектНачислениеУдержание.Наименование)+"""'");
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'План видов расчета ""Начисления и удержания""'") +" «" + СсылкаНачислениеУдержание
					+ "» " + НСтр("ru = 'для строки'") + " " + НомерСтроки + " " + "макета" +" «" + ИмяМакета + "» " 
					+ НСтр("ru = 'не обновлена.'") + Символы.ПС + "Ошибка:" + " " + ОписаниеОшибки());

			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("Код");
	ОбязательныеРеквизиты.Добавить("СтатьяДоходовИРасходов");
	ОбязательныеРеквизиты.Добавить("СпособРасчета");
	ОбязательныеРеквизиты.Добавить("НачислениеИлиУдержание");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "СпособРасчета".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СпособРасчетаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ (Объект.СпособРасчета = Перечисления.СпособыРасчета.Процентом) Тогда
		Объект.ВидОбъекта   = 0;
		Объект.ПутьКОбъекту = "";
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "ВидОбъекта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВидОбъектаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Объект.ПутьКОбъекту = "";
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
